# Leçon SQL 1: requêtes SELECT 101

Pour récupérer des données à partir d'une base de données SQL, nous devons écrire des instructions SELECT, qui sont souvent communément appelées **requêtes**. Une requête en elle-même n'est qu'une instruction qui déclare quelles données nous recherchons, où les trouver dans la base de données et, éventuellement, comment les transformer avant qu'elles ne soient renvoyées. Il a cependant une syntaxe spécifique, ce que nous allons apprendre dans les exercices suivants.

Comme nous l'avons mentionné dans l'introduction, vous pouvez considérer une table en SQL comme un type d'entité (c.-à-d. Chiens) et chaque ligne de cette table comme une **instance** spécifique de ce type (c.-à-d. Un carlin, un beagle , un carlin de couleur différente, etc.). Cela signifie que les colonnes représenteraient alors les propriétés communes partagées par toutes les instances de cette entité (c'est-à-dire la couleur de la fourrure, la longueur de la queue, etc.).

Et étant donné une table de données, la requête la plus basique que nous pourrions écrire serait celle qui sélectionne quelques colonnes (propriétés) de la table avec toutes les lignes (instances).

Sélectionner une requête pour une colonne spécifique

``` mysql 
SELECT column, another_column, …
FROM mytable;
```

Le résultat de cette requête sera un ensemble bidimensionnel de lignes et de colonnes, en fait une copie de la table, mais uniquement avec les colonnes que nous avons demandées.

Si nous voulons récupérer absolument toutes les colonnes de données d'une table, nous pouvons alors utiliser le *raccourci astérisque ( ) au lieu de lister tous les noms de colonnes individuellement.

Sélectionnez la requête pour toutes les colonnes

``` mysql 
SELECT * 
FROM mytable;
```

Cette requête, en particulier, est vraiment utile car c'est un moyen simple d'inspecter une table en vidant toutes les données à la fois.

## Exercice

Nous utiliserons une base de données contenant des données sur certains des films classiques de Pixar pour la plupart de nos exercices. Ce premier exercice ne concernera que la table **Movies**, et la requête par défaut ci-dessous affiche actuellement toutes les propriétés de chaque film. Pour passer à la leçon suivante, modifiez la requête pour trouver les informations exactes dont nous avons besoin pour chaque tâche.

**IMPORTANT : Afin de répondre aux questions de l'exercise d'insérer la requête entre les doubles quotes " "**

In [23]:
import pandas as pd

def to_df(s):
    l= [elt.split(';') for elt in s.replace("	", ";").split('\n')]
    return pd.DataFrame(l[1:], columns=l[0])

In [24]:
from pandasql import sqldf

In [7]:
x="""Id	Title	Director	Year	Length_minutes
1	Toy Story	John Lasseter	1995	81
2	A Bug's Life	John Lasseter	1998	95
3	Toy Story 2	John Lasseter	1999	93
4	Monsters, Inc.	Pete Docter	2001	92
5	Finding Nemo	Andrew Stanton	2003	107
6	The Incredibles	Brad Bird	2004	116
7	Cars	John Lasseter	2006	117
8	Ratatouille	Brad Bird	2007	115
9	WALL-E	Andrew Stanton	2008	104
10	Up	Pete Docter	2009	101
11	Toy Story 3	Lee Unkrich	2010	103
12	Cars 2	John Lasseter	2011	120
13	Brave	Brenda Chapman	2012	102
14	Monsters University	Dan Scanlon	2013	110"""
Movies = to_df(x)

In [8]:
Movies

    Id                Title        Director  Year Length_minutes
0    1            Toy Story   John Lasseter  1995             81
1    2         A Bug's Life   John Lasseter  1998             95
2    3          Toy Story 2   John Lasseter  1999             93
3    4       Monsters, Inc.     Pete Docter  2001             92
4    5         Finding Nemo  Andrew Stanton  2003            107
5    6      The Incredibles       Brad Bird  2004            116
6    7                 Cars   John Lasseter  2006            117
7    8          Ratatouille       Brad Bird  2007            115
8    9               WALL-E  Andrew Stanton  2008            104
9   10                   Up     Pete Docter  2009            101
10  11          Toy Story 3     Lee Unkrich  2010            103
11  12               Cars 2   John Lasseter  2011            120
12  13                Brave  Brenda Chapman  2012            102
13  14  Monsters University     Dan Scanlon  2013            110

1. Retrouvez le title de chaque film

In [9]:
QUERY1 = "SELECT Title from Movies"

In [10]:
sqldf(QUERY1)

                  Title
0             Toy Story
1          A Bug's Life
2           Toy Story 2
3        Monsters, Inc.
4          Finding Nemo
5       The Incredibles
6                  Cars
7           Ratatouille
8                WALL-E
9                    Up
10          Toy Story 3
11               Cars 2
12                Brave
13  Monsters University

2. Retrouvez le directorde chaque film

In [15]:
QUERY2 = "SELECT Director from Movies"

In [16]:
sqldf(QUERY2)

          Director
0    John Lasseter
1    John Lasseter
2    John Lasseter
3      Pete Docter
4   Andrew Stanton
5        Brad Bird
6    John Lasseter
7        Brad Bird
8   Andrew Stanton
9      Pete Docter
10     Lee Unkrich
11   John Lasseter
12  Brenda Chapman
13     Dan Scanlon

3. Retrouvez le title et directorde chaque film

In [17]:
QUERY3 = "SELECT Director,Title from Movies"

In [18]:
sqldf(QUERY3)

          Director                Title
0    John Lasseter            Toy Story
1    John Lasseter         A Bug's Life
2    John Lasseter          Toy Story 2
3      Pete Docter       Monsters, Inc.
4   Andrew Stanton         Finding Nemo
5        Brad Bird      The Incredibles
6    John Lasseter                 Cars
7        Brad Bird          Ratatouille
8   Andrew Stanton               WALL-E
9      Pete Docter                   Up
10     Lee Unkrich          Toy Story 3
11   John Lasseter               Cars 2
12  Brenda Chapman                Brave
13     Dan Scanlon  Monsters University

4. Retrouvez le title et year de chaque film

In [19]:
QUERY4 = "SELECT Title,Year from Movies"

In [20]:
sqldf(QUERY4)

                  Title  Year
0             Toy Story  1995
1          A Bug's Life  1998
2           Toy Story 2  1999
3        Monsters, Inc.  2001
4          Finding Nemo  2003
5       The Incredibles  2004
6                  Cars  2006
7           Ratatouille  2007
8                WALL-E  2008
9                    Up  2009
10          Toy Story 3  2010
11               Cars 2  2011
12                Brave  2012
13  Monsters University  2013

5. Retrouvez toutes les informations sur chaque film

In [21]:
QUERY5 = "SELECT *from Movies"

In [22]:
sqldf(QUERY5)

    Id                Title        Director  Year Length_minutes
0    1            Toy Story   John Lasseter  1995             81
1    2         A Bug's Life   John Lasseter  1998             95
2    3          Toy Story 2   John Lasseter  1999             93
3    4       Monsters, Inc.     Pete Docter  2001             92
4    5         Finding Nemo  Andrew Stanton  2003            107
5    6      The Incredibles       Brad Bird  2004            116
6    7                 Cars   John Lasseter  2006            117
7    8          Ratatouille       Brad Bird  2007            115
8    9               WALL-E  Andrew Stanton  2008            104
9   10                   Up     Pete Docter  2009            101
10  11          Toy Story 3     Lee Unkrich  2010            103
11  12               Cars 2   John Lasseter  2011            120
12  13                Brave  Brenda Chapman  2012            102
13  14  Monsters University     Dan Scanlon  2013            110